Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Факс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Skype</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Контрагенты</Name>
			<Comment>Контрагенты (покупатели, поставщики и т.д.)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОтправкиЭлектронногоЧека</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыОтправкиЭлектронногоЧекаПокупателю</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКонтрагента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидКонтрагента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыДоступаККонтрагентам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументУдостоверяющийЛичность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДокументыУдостоверяющиеЛичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дополнительно</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторБ24</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификационныйНомерПлательщикаЕвропейскогоНДС</Name>
					<Comment>VAT Number</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицоПодписант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеОтправлятьСМС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОГРН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойБанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойДоговор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправлятьСМС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказыватьДопИнформацию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическогоЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПотолкиОнлайн_Актуализирован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПотолкиОнлайн_Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РекламныйИсточник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РекламныеИсточники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_Опт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_ОсновнойEMail</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_ОсновнойТелефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_ОсновнойТелефон_ТолькоЦифры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_ПереноситьДокументыВБухгалтерию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_Розница</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_ФактическийАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_ЮридическийАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Метка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МеткиКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособДоставкиТовара</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыДоставкиТовара</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КредитныйЛимит</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриоритетыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКлиента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегионКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Города</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>УДАЛИТЬ_АдресаДоставки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основной</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/КонтактнаяИнформацияПотолки/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

#Область СобытияФормы


#КонецОбласти

// Функция возвращает таблицу типов контактной информации в порядке по умолчанию
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Стандартный порядок типов контактной информации для отображения в интерфейсе
//
Функция ПорядокТиповКИ() Экспорт
	
	ПорядокТиповКИ = Новый ТаблицаЗначений;
	ПорядокТиповКИ.Колонки.Добавить("Тип", Новый ОписаниеТипов("ПеречислениеСсылка.ТипыКонтактнойИнформации"));
	ПорядокТиповКИ.Колонки.Добавить("Порядок", Новый ОписаниеТипов("Число"));
	
	СтрокаТипов = ПорядокТиповКИ.Добавить();
	СтрокаТипов.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
	СтрокаТипов.Порядок = 1;
	
	СтрокаТипов = ПорядокТиповКИ.Добавить();
	СтрокаТипов.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
	СтрокаТипов.Порядок = 2;
	
	СтрокаТипов = ПорядокТиповКИ.Добавить();
	СтрокаТипов.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
	СтрокаТипов.Порядок = 3;
	
	СтрокаТипов = ПорядокТиповКИ.Добавить();
	СтрокаТипов.Тип = Перечисления.ТипыКонтактнойИнформации.Skype;
	СтрокаТипов.Порядок = 4;
	
	СтрокаТипов = ПорядокТиповКИ.Добавить();
	СтрокаТипов.Тип = Перечисления.ТипыКонтактнойИнформации.ВебСтраница;
	СтрокаТипов.Порядок = 5;
	
	СтрокаТипов = ПорядокТиповКИ.Добавить();
	СтрокаТипов.Тип = Перечисления.ТипыКонтактнойИнформации.Факс;
	СтрокаТипов.Порядок = 6;
	
	СтрокаТипов = ПорядокТиповКИ.Добавить();
	СтрокаТипов.Тип = Перечисления.ТипыКонтактнойИнформации.Другое;
	СтрокаТипов.Порядок = 7;
	
	Возврат ПорядокТиповКИ;
	
КонецФункции

Функция КонтрагентПоНомеруТелефона(знач НомерТелефонаАбонента, ИскатьВКонтрагентах = Истина, ИскатьВКонтактах = Ложь) Экспорт
	
	Если ТипЗнч(НомерТелефонаАбонента) = Тип("Строка") И Не ЗначениеЗаполнено(СокрЛП(НомерТелефонаАбонента)) Тогда
		Возврат Неопределено;
	ИначеЕсли ТипЗнч(НомерТелефонаАбонента) = Тип("ОбъектXDTO") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПоисковоеВыражение = СофтФон.ОставитьТолькоЦифры(НомерТелефонаАбонента);
	Возврат ПолучитьАбонентаПоНомеруТелефона(ПоисковоеВыражение, ИскатьВКонтрагентах, ИскатьВКонтактах);
	
КонецФункции

// Поиск контакта (Контрагент/КонтактноеЛицо) по номеру телефона.
//
// Параметры:
//  НомерТелефонаАбонента - Строка - Номер телефона контакта.
//  ИскатьВКонтрагентах   - Булево - Указывает, искать ли среди справочника Контрагенты.
//  ИскатьВКонтактах      - Булево - Указывает, искать ли среди справочника КонтактныеЛица.
// 
// Возвращаемое значение:
//   - Неопределено, СправочникСсылка.Контрагенты, СправочникСсылка.КонтактныеЛица.
//
Функция ПолучитьАбонентаПоНомеруТелефона(Знач НомерТелефонаАбонента, ИскатьВКонтрагентах = Истина, ИскатьВКонтактах = Ложь) Экспорт
	
	Если НЕ ИскатьВКонтрагентах И НЕ ИскатьВКонтактах Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПоисковоеВыражение = НомерТелефонаАбонента;
	
	ТипыАбонентов = Новый Массив;
	
	Если ИскатьВКонтрагентах Тогда
		ТипыАбонентов.Добавить(Метаданные.Справочники.Контрагенты);
	КонецЕсли;
	
	Если ИскатьВКонтактах Тогда
		ТипыАбонентов.Добавить(Метаданные.Справочники.КонтактныеЛица);
	КонецЕсли;
	
	Если ТипыАбонентов.Количество() <> 0 Тогда
		Контакт = АбонентПоНомеруТелефона(ПоисковоеВыражение, ТипыАбонентов);
		Если Контакт <> Неопределено Тогда
			Возврат Контакт;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция АбонентПоНомеруТелефона(ПоисковоеВыражение, ТипыАбонентов)
	
	СекцияОбъединить = "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|";
	БазаЗапроса = "
		|ВЫБРАТЬ
		|	КонтактнаяИнформация_1.Ссылка
		|ИЗ
		|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтактнаяИнформация_1
		|ГДЕ
		|	КонтактнаяИнформация_1.НомерТелефона ПОДОБНО &ПоисковоеВыражение
		|	И КонтактнаяИнформация_1.Тип = &ТипТелефон";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПоисковоеВыражение", ПоисковоеВыражение);
	Запрос.УстановитьПараметр("ТипТелефон", Перечисления.ТипыКонтактнойИнформации.Телефон);
	Запрос.Текст = "";
	НомерОбъединения = 0;
	
	Для Каждого ТипАбонента Из ТипыАбонентов Цикл
		
		НомерОбъединения = НомерОбъединения + 1;
		ЧастьОбъединения = СтрЗаменить(БазаЗапроса, "Справочник.Контрагенты", ТипАбонента.ПолноеИмя());
		ЧастьОбъединения = СтрЗаменить(ЧастьОбъединения, "КонтактнаяИнформация_1", "КонтактнаяИнформация_" + НомерОбъединения);
		
		Запрос.Текст = Запрос.Текст + ?(ПустаяСтрока(Запрос.Текст), "", СекцияОбъединить) + ЧастьОбъединения;
		
	КонецЦикла;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Если ТипЗнч(Выборка.Ссылка) = Тип("СправочникСсылка.КонтактныеЛица") Тогда
			Возврат ОБщегоНазначения.ЗначениеРеквизитаОбъекта(Выборка.Ссылка, "ОбъектВладелец");
		КонецЕсли;
		
		Возврат Выборка.Ссылка;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция КонтрагентПоАдресуЭП(знач АдресЭП, ИскатьВКонтрагентах = Истина, ИскатьВКонтактах = Ложь) Экспорт
	
	Если ТипЗнч(АдресЭП) = Тип("Строка") И НЕ ЗначениеЗаполнено(АдресЭП) Тогда
		Возврат Неопределено;
	ИначеЕсли ТипЗнч(АдресЭП) = Тип("ОбъектXDTO") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КонтрагентыКонтактнаяИнформация.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ втАдреса
	|ИЗ
	|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	|ГДЕ
	|	КонтрагентыКонтактнаяИнформация.АдресЭП = &АдресЭП
	|	И КонтрагентыКонтактнаяИнформация.Тип = &АдресЭлектроннойПочты
	|	И &ИскатьВКонтрагентах
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтактныеЛицаКонтактнаяИнформация.Ссылка.ОбъектВладелец
	|ИЗ
	|	Справочник.КонтактныеЛица.КонтактнаяИнформация КАК КонтактныеЛицаКонтактнаяИнформация
	|ГДЕ
	|	КонтактныеЛицаКонтактнаяИнформация.АдресЭП = &АдресЭП
	|	И КонтактныеЛицаКонтактнаяИнформация.Тип = &АдресЭлектроннойПочты
	|	И &ИскатьВКонтактах
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтрагентыКонтактнаяИнформация.Ссылка
	|ИЗ
	|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	|ГДЕ
	|	КонтрагентыКонтактнаяИнформация.Представление = &АдресЭП
	|	И КонтрагентыКонтактнаяИнформация.Тип = &АдресЭлектроннойПочты
	|	И &ИскатьВКонтрагентах
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втАдреса.Ссылка КАК Ссылка
	|ИЗ
	|	втАдреса КАК втАдреса
	|
	|СГРУППИРОВАТЬ ПО
	|	втАдреса.Ссылка";
	Запрос.УстановитьПараметр("АдресЭП", Нрег(СокрЛП(АдресЭП)));
	Запрос.УстановитьПараметр("АдресЭлектроннойПочты", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	Запрос.УстановитьПараметр("ИскатьВКонтрагентах", ИскатьВКонтрагентах);
	Запрос.УстановитьПараметр("ИскатьВКонтактах", ИскатьВКонтактах);
	
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

#Область ОбновлениеИнформационнойБазы

// Процедура обновляет/дозаполняет предопределенные виды контактной информации. Начальное заполнение базы.
//
Процедура УстановитьСвойстваПредопределенныхВидовКонтактнойИнформации() Экспорт
	
	Контрагенты_УстановитьСвойстваВидов();
	КонтактныеЛица_УстановитьСвойстваВидов();
	Организации_УстановитьСвойстваВидов();
	Пользователи_УстановитьСвойстваВидов();
	Сотрудники_УстановитьСвойстваВидов();
	
КонецПроцедуры

Процедура Контрагенты_УстановитьСвойстваВидов()
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации("Телефон");
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента;
	ПараметрыВида.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
	ПараметрыВида.Порядок = 1;
	ПараметрыВида.МожноИзменятьСпособРедактирования		= Истина;
	//ПараметрыВида.ВидРедактирования						= "ПолеВвода";
	ПараметрыВида.ОбязательноеЗаполнение				= Ложь;
	ПараметрыВида.РазрешитьВводНесколькихЗначений		= Истина;
	ПараметрыВида.ЗапретитьРедактированиеПользователем	= Ложь;
	ПараметрыВида.Используется							= Истина;
	ПараметрыВида.НастройкиПроверки.ТелефонCДобавочнымНомером	= Истина;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации("АдресЭлектроннойПочты");
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.EmailКонтрагента;
	ПараметрыВида.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
	ПараметрыВида.Порядок = 2;
	ПараметрыВида.МожноИзменятьСпособРедактирования		= Истина;
	//ПараметрыВида.ВидРедактирования						= "ПолеВвода";
	ПараметрыВида.ОбязательноеЗаполнение				= Ложь;
	ПараметрыВида.РазрешитьВводНесколькихЗначений		= Истина;
	ПараметрыВида.ЗапретитьРедактированиеПользователем	= Ложь;
	ПараметрыВида.Используется							= Истина;
	ПараметрыВида.НастройкиПроверки.ПроверятьКорректность		= Истина;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации("Адрес");
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента;
	ПараметрыВида.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
	ПараметрыВида.Порядок = 3;
	ПараметрыВида.МожноИзменятьСпособРедактирования		= Истина;
	//ПараметрыВида.ВидРедактирования						= "ПолеВвода";
	ПараметрыВида.ОбязательноеЗаполнение				= Ложь;
	ПараметрыВида.РазрешитьВводНесколькихЗначений		= Ложь;
	ПараметрыВида.ЗапретитьРедактированиеПользователем	= Ложь;
	ПараметрыВида.Используется							= Истина;
	ПараметрыВида.НастройкиПроверки.ТолькоНациональныйАдрес			= Ложь;
	ПараметрыВида.НастройкиПроверки.ПроверятьКорректность			= Ложь;
	ПараметрыВида.НастройкиПроверки.ПроверятьПоФИАС					= Ложь;
	ПараметрыВида.НастройкиПроверки.СкрыватьНеактуальныеАдреса		= Ложь;
	ПараметрыВида.НастройкиПроверки.ВключатьСтрануВПредставление	= Ложь;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);	
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации("Адрес");
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента;
	ПараметрыВида.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
	ПараметрыВида.Порядок = 4;
	ПараметрыВида.МожноИзменятьСпособРедактирования		= Истина;
	//ПараметрыВида.ВидРедактирования						= "ПолеВвода";
	ПараметрыВида.ОбязательноеЗаполнение				= Ложь;
	ПараметрыВида.РазрешитьВводНесколькихЗначений		= Ложь;
	ПараметрыВида.ЗапретитьРедактированиеПользователем	= Ложь;
	ПараметрыВида.Используется							= Истина;
	ПараметрыВида.НастройкиПроверки.ТолькоНациональныйАдрес			= Ложь;
	ПараметрыВида.НастройкиПроверки.ПроверятьКорректность			= Ложь;
	ПараметрыВида.НастройкиПроверки.ПроверятьПоФИАС					= Ложь;
	ПараметрыВида.НастройкиПроверки.СкрыватьНеактуальныеАдреса		= Ложь;
	ПараметрыВида.НастройкиПроверки.ВключатьСтрануВПредставление	= Ложь;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);	
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации("Адрес");
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.АдресДоставкиКонтрагента;
	ПараметрыВида.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
	ПараметрыВида.Порядок = 5;
	ПараметрыВида.МожноИзменятьСпособРедактирования		= Истина;
	//ПараметрыВида.ВидРедактирования						= "ПолеВвода";
	ПараметрыВида.ОбязательноеЗаполнение				= Ложь;
	ПараметрыВида.РазрешитьВводНесколькихЗначений		= Истина;
	ПараметрыВида.ЗапретитьРедактированиеПользователем	= Ложь;
	ПараметрыВида.Используется							= Истина;
	ПараметрыВида.НастройкиПроверки.ТолькоНациональныйАдрес			= Ложь;
	ПараметрыВида.НастройкиПроверки.ПроверятьКорректность			= Ложь;
	ПараметрыВида.НастройкиПроверки.ПроверятьПоФИАС					= Ложь;
	ПараметрыВида.НастройкиПроверки.СкрыватьНеактуальныеАдреса		= Ложь;
	ПараметрыВида.НастройкиПроверки.ВключатьСтрануВПредставление	= Ложь;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации("Skype");
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.SkypeКонтрагента;
	ПараметрыВида.Тип = Перечисления.ТипыКонтактнойИнформации.Skype;
	ПараметрыВида.Порядок = 6;
	ПараметрыВида.МожноИзменятьСпособРедактирования		= Истина;
	//ПараметрыВида.ВидРедактирования						= "ПолеВвода";
	ПараметрыВида.ОбязательноеЗаполнение				= Ложь;
	ПараметрыВида.РазрешитьВводНесколькихЗначений		= Ложь;
	ПараметрыВида.ЗапретитьРедактированиеПользователем	= Ложь;
	ПараметрыВида.Используется							= Истина;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации("ВебСтраница");
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.ВебСайтКонтрагента;
	ПараметрыВида.Тип = Перечисления.ТипыКонтактнойИнформации.ВебСтраница;
	ПараметрыВида.Порядок = 7;
	ПараметрыВида.МожноИзменятьСпособРедактирования		= Истина;
	//ПараметрыВида.ВидРедактирования						= "ПолеВвода";
	ПараметрыВида.ОбязательноеЗаполнение				= Ложь;
	ПараметрыВида.РазрешитьВводНесколькихЗначений		= Ложь;
	ПараметрыВида.ЗапретитьРедактированиеПользователем	= Ложь;
	ПараметрыВида.Используется							= Истина;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации("Факс");
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.ФаксКонтрагента;
	ПараметрыВида.Тип = Перечисления.ТипыКонтактнойИнформации.Факс;
	ПараметрыВида.Порядок = 8;
	ПараметрыВида.МожноИзменятьСпособРедактирования		= Истина;
	//ПараметрыВида.ВидРедактирования						= "ПолеВвода";
	ПараметрыВида.ОбязательноеЗаполнение				= Ложь;
	ПараметрыВида.РазрешитьВводНесколькихЗначений		= Ложь;
	ПараметрыВида.ЗапретитьРедактированиеПользователем	= Ложь;
	ПараметрыВида.Используется							= Истина;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации("Адрес");
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресКонтрагента;
	ПараметрыВида.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
	ПараметрыВида.Порядок = 9;
	ПараметрыВида.МожноИзменятьСпособРедактирования		= Истина;
	//ПараметрыВида.ВидРедактирования						= "ПолеВвода";
	ПараметрыВида.ОбязательноеЗаполнение				= Ложь;
	ПараметрыВида.РазрешитьВводНесколькихЗначений		= Ложь;
	ПараметрыВида.ЗапретитьРедактированиеПользователем	= Ложь;
	ПараметрыВида.Используется							= Истина;
	ПараметрыВида.НастройкиПроверки.ТолькоНациональныйАдрес			= Ложь;
	ПараметрыВида.НастройкиПроверки.ПроверятьКорректность			= Ложь;
	ПараметрыВида.НастройкиПроверки.ПроверятьПоФИАС					= Ложь;
	ПараметрыВида.НастройкиПроверки.СкрыватьНеактуальныеАдреса		= Ложь;
	ПараметрыВида.НастройкиПроверки.ВключатьСтрануВПредставление	= Ложь;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации("Другое");
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.ДругаяИнформацияКонтрагента;
	ПараметрыВида.Тип = Перечисления.ТипыКонтактнойИнформации.Другое;
	ПараметрыВида.Порядок = 10;
	ПараметрыВида.МожноИзменятьСпособРедактирования		= Истина;
	//ПараметрыВида.ВидРедактирования						= "ПолеВвода";
	ПараметрыВида.ОбязательноеЗаполнение				= Ложь;
	ПараметрыВида.РазрешитьВводНесколькихЗначений		= Ложь;
	ПараметрыВида.ЗапретитьРедактированиеПользователем	= Ложь;
	ПараметрыВида.Используется							= Истина;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
КонецПроцедуры

Процедура Организации_УстановитьСвойстваВидов()
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации("Адрес");
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации;
	ПараметрыВида.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
	ПараметрыВида.Порядок = 1;
	ПараметрыВида.МожноИзменятьСпособРедактирования		= Истина;
	//ПараметрыВида.ВидРедактирования						= "Диалог";
	ПараметрыВида.ОбязательноеЗаполнение				= Ложь;
	ПараметрыВида.РазрешитьВводНесколькихЗначений		= Ложь;
	ПараметрыВида.ЗапретитьРедактированиеПользователем	= Ложь;
	ПараметрыВида.Используется							= Истина;
	ПараметрыВида.НастройкиПроверки.ТолькоНациональныйАдрес			= Ложь;
	ПараметрыВида.НастройкиПроверки.ПроверятьКорректность			= Ложь;
	ПараметрыВида.НастройкиПроверки.ПроверятьПоФИАС					= Ложь;
	ПараметрыВида.НастройкиПроверки.СкрыватьНеактуальныеАдреса		= Ложь;
	ПараметрыВида.НастройкиПроверки.ВключатьСтрануВПредставление	= Ложь;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);	
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации("Адрес");
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации;
	ПараметрыВида.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
	ПараметрыВида.Порядок = 2;
	ПараметрыВида.МожноИзменятьСпособРедактирования		= Истина;
	//ПараметрыВида.ВидРедактирования						= "Диалог";
	ПараметрыВида.ОбязательноеЗаполнение				= Ложь;
	ПараметрыВида.РазрешитьВводНесколькихЗначений		= Ложь;
	ПараметрыВида.ЗапретитьРедактированиеПользователем	= Ложь;
	ПараметрыВида.Используется							= Истина;
	ПараметрыВида.НастройкиПроверки.ТолькоНациональныйАдрес			= Ложь;
	ПараметрыВида.НастройкиПроверки.ПроверятьКорректность			= Ложь;
	ПараметрыВида.НастройкиПроверки.ПроверятьПоФИАС					= Ложь;
	ПараметрыВида.НастройкиПроверки.СкрыватьНеактуальныеАдреса		= Ложь;
	ПараметрыВида.НастройкиПроверки.ВключатьСтрануВПредставление	= Ложь;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);	
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации("Адрес");
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресОрганизации;
	ПараметрыВида.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
	ПараметрыВида.Порядок = 3;
	ПараметрыВида.МожноИзменятьСпособРедактирования		= Истина;
	//ПараметрыВида.ВидРедактирования						= "ПолеВвода";
	ПараметрыВида.ОбязательноеЗаполнение				= Ложь;
	ПараметрыВида.РазрешитьВводНесколькихЗначений		= Ложь;
	ПараметрыВида.ЗапретитьРедактированиеПользователем	= Ложь;
	ПараметрыВида.Используется							= Истина;
	ПараметрыВида.НастройкиПроверки.ТолькоНациональныйАдрес			= Ложь;
	ПараметрыВида.НастройкиПроверки.ПроверятьКорректность			= Ложь;
	ПараметрыВида.НастройкиПроверки.ПроверятьПоФИАС					= Ложь;
	ПараметрыВида.НастройкиПроверки.СкрыватьНеактуальныеАдреса		= Ложь;
	ПараметрыВида.НастройкиПроверки.ВключатьСтрануВПредставление	= Ложь;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);	
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации("Телефон");
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации;
	ПараметрыВида.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
	ПараметрыВида.Порядок = 4;
	ПараметрыВида.МожноИзменятьСпособРедактирования		= Истина;
	//ПараметрыВида.ВидРедактирования						= "ПолеВвода";
	ПараметрыВида.ОбязательноеЗаполнение				= Ложь;
	ПараметрыВида.РазрешитьВводНесколькихЗначений		= Истина;
	ПараметрыВида.ЗапретитьРедактированиеПользователем	= Ложь;
	ПараметрыВида.Используется							= Истина;
	ПараметрыВида.НастройкиПроверки.ТелефонCДобавочнымНомером	= Истина;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);	
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации("АдресЭлектроннойПочты");
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.EmailОрганизации;
	ПараметрыВида.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
	ПараметрыВида.Порядок = 5;
	ПараметрыВида.МожноИзменятьСпособРедактирования		= Истина;
	//ПараметрыВида.ВидРедактирования						= "ПолеВвода";
	ПараметрыВида.ОбязательноеЗаполнение				= Ложь;
	ПараметрыВида.РазрешитьВводНесколькихЗначений		= Ложь;
	ПараметрыВида.ЗапретитьРедактированиеПользователем	= Ложь;
	ПараметрыВида.Используется							= Истина;
	ПараметрыВида.НастройкиПроверки.ПроверятьКорректность		= Истина;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);	
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации("ВебСтраница");
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.СайтОрганизации;
	ПараметрыВида.Тип = Перечисления.ТипыКонтактнойИнформации.ВебСтраница;
	ПараметрыВида.Порядок = 6;
	ПараметрыВида.МожноИзменятьСпособРедактирования		= Истина;
	//ПараметрыВида.ВидРедактирования						= "ПолеВвода";
	ПараметрыВида.ОбязательноеЗаполнение				= Ложь;
	ПараметрыВида.РазрешитьВводНесколькихЗначений		= Ложь;
	ПараметрыВида.ЗапретитьРедактированиеПользователем	= Ложь;
	ПараметрыВида.Используется							= Истина;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации("Факс");
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.ФаксОрганизации;
	ПараметрыВида.Тип = Перечисления.ТипыКонтактнойИнформации.Факс;
	ПараметрыВида.Порядок = 7;
	ПараметрыВида.МожноИзменятьСпособРедактирования		= Истина;
	//ПараметрыВида.ВидРедактирования						= "ПолеВвода";
	ПараметрыВида.ОбязательноеЗаполнение				= Ложь;
	ПараметрыВида.РазрешитьВводНесколькихЗначений		= Ложь;
	ПараметрыВида.ЗапретитьРедактированиеПользователем	= Ложь;
	ПараметрыВида.Используется							= Истина;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации("Другое");
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.ДругаяИнформацияОрганизации;
	ПараметрыВида.Тип = Перечисления.ТипыКонтактнойИнформации.Другое;
	ПараметрыВида.Порядок = 8;
	ПараметрыВида.МожноИзменятьСпособРедактирования		= Истина;
	//ПараметрыВида.ВидРедактирования						= "ПолеВвода";
	ПараметрыВида.ОбязательноеЗаполнение				= Ложь;
	ПараметрыВида.РазрешитьВводНесколькихЗначений		= Ложь;
	ПараметрыВида.ЗапретитьРедактированиеПользователем	= Ложь;
	ПараметрыВида.Используется							= Истина;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
КонецПроцедуры

Процедура Пользователи_УстановитьСвойстваВидов()
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации("Телефон");
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонПользователя;
	ПараметрыВида.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
	ПараметрыВида.Порядок = 1;
	ПараметрыВида.МожноИзменятьСпособРедактирования		= Истина;
	//ПараметрыВида.ВидРедактирования						= "ПолеВвода";
	ПараметрыВида.ОбязательноеЗаполнение				= Ложь;
	ПараметрыВида.РазрешитьВводНесколькихЗначений		= Ложь;
	ПараметрыВида.ЗапретитьРедактированиеПользователем	= Ложь;
	ПараметрыВида.Используется							= Истина;
	ПараметрыВида.НастройкиПроверки.ТелефонCДобавочнымНомером	= Истина;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);	
	
	//ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации("АдресЭлектроннойПочты");
	//ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.EmailПользователя;
	//ПараметрыВида.Порядок = 2;
	//ПараметрыВида.МожноИзменятьСпособРедактирования		= Истина;
	//ПараметрыВида.ВидРедактирования						= "ПолеВвода";
	//ПараметрыВида.ОбязательноеЗаполнение				= Ложь;
	//ПараметрыВида.РазрешитьВводНесколькихЗначений		= Ложь;
	//ПараметрыВида.ЗапретитьРедактированиеПользователем	= Ложь;
	//ПараметрыВида.Используется							= Истина;
	//ПараметрыВида.НастройкиПроверки.ПроверятьКорректность		= Истина;
	//УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);	
	
КонецПроцедуры

Процедура Сотрудники_УстановитьСвойстваВидов()
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации("Телефон");
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонСотрудника;
	ПараметрыВида.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
	ПараметрыВида.Порядок = 1;
	ПараметрыВида.МожноИзменятьСпособРедактирования		= Истина;
	//ПараметрыВида.ВидРедактирования						= "ПолеВвода";
	ПараметрыВида.ОбязательноеЗаполнение				= Ложь;
	ПараметрыВида.РазрешитьВводНесколькихЗначений		= Истина;
	ПараметрыВида.ЗапретитьРедактированиеПользователем	= Ложь;
	ПараметрыВида.Используется							= Истина;
	ПараметрыВида.НастройкиПроверки.ТелефонCДобавочнымНомером	= Истина;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);	
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации("АдресЭлектроннойПочты");
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.EmailСотрудника;
	ПараметрыВида.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
	ПараметрыВида.Порядок = 2;
	ПараметрыВида.МожноИзменятьСпособРедактирования		= Истина;
	//ПараметрыВида.ВидРедактирования						= "ПолеВвода";
	ПараметрыВида.ОбязательноеЗаполнение				= Ложь;
	ПараметрыВида.РазрешитьВводНесколькихЗначений		= Истина;
	ПараметрыВида.ЗапретитьРедактированиеПользователем	= Ложь;
	ПараметрыВида.Используется							= Истина;
	ПараметрыВида.НастройкиПроверки.ПроверятьКорректность		= Истина;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации("Телефон");
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.ЛичныйТелефонСотрудника;
	ПараметрыВида.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
	ПараметрыВида.Порядок = 3;
	ПараметрыВида.МожноИзменятьСпособРедактирования		= Истина;
	//ПараметрыВида.ВидРедактирования						= "ПолеВвода";
	ПараметрыВида.ОбязательноеЗаполнение				= Ложь;
	ПараметрыВида.РазрешитьВводНесколькихЗначений		= Истина;
	ПараметрыВида.ЗапретитьРедактированиеПользователем	= Ложь;
	ПараметрыВида.Используется							= Истина;
	ПараметрыВида.НастройкиПроверки.ТелефонCДобавочнымНомером	= Истина;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);	
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации("АдресЭлектроннойПочты");
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.ЛичныйEmailСотрудника;
	ПараметрыВида.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
	ПараметрыВида.Порядок = 4;
	ПараметрыВида.МожноИзменятьСпособРедактирования		= Истина;
	//ПараметрыВида.ВидРедактирования						= "ПолеВвода";
	ПараметрыВида.ОбязательноеЗаполнение				= Ложь;
	ПараметрыВида.РазрешитьВводНесколькихЗначений		= Истина;
	ПараметрыВида.ЗапретитьРедактированиеПользователем	= Ложь;
	ПараметрыВида.Используется							= Истина;
	ПараметрыВида.НастройкиПроверки.ПроверятьКорректность		= Истина;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации("Адрес");
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.ФактАдресСотрудника;
	ПараметрыВида.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
	ПараметрыВида.Порядок = 5;
	ПараметрыВида.МожноИзменятьСпособРедактирования		= Истина;
	//ПараметрыВида.ВидРедактирования						= "Диалог";
	ПараметрыВида.ОбязательноеЗаполнение				= Ложь;
	ПараметрыВида.РазрешитьВводНесколькихЗначений		= Ложь;
	ПараметрыВида.ЗапретитьРедактированиеПользователем	= Ложь;
	ПараметрыВида.Используется							= Истина;
	ПараметрыВида.НастройкиПроверки.ТолькоНациональныйАдрес			= Ложь;
	ПараметрыВида.НастройкиПроверки.ПроверятьКорректность			= Ложь;
	ПараметрыВида.НастройкиПроверки.ПроверятьПоФИАС					= Ложь;
	ПараметрыВида.НастройкиПроверки.СкрыватьНеактуальныеАдреса		= Ложь;
	ПараметрыВида.НастройкиПроверки.ВключатьСтрануВПредставление	= Ложь;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
КонецПроцедуры

Процедура КонтактныеЛица_УстановитьСвойстваВидов()
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации("Телефон");
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонКонтактногоЛица;
	ПараметрыВида.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
	ПараметрыВида.Порядок = 1;
	ПараметрыВида.МожноИзменятьСпособРедактирования		= Истина;
	//ПараметрыВида.ВидРедактирования						= "ПолеВвода";
	ПараметрыВида.ОбязательноеЗаполнение				= Ложь;
	ПараметрыВида.РазрешитьВводНесколькихЗначений		= Ложь;
	ПараметрыВида.ЗапретитьРедактированиеПользователем	= Ложь;
	ПараметрыВида.Используется							= Истина;
	ПараметрыВида.НастройкиПроверки.ТелефонCДобавочнымНомером	= Истина;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);	
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации("АдресЭлектроннойПочты");
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.EmailКонтактногоЛица;
	ПараметрыВида.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
	ПараметрыВида.Порядок = 2;
	ПараметрыВида.МожноИзменятьСпособРедактирования		= Истина;
	//ПараметрыВида.ВидРедактирования						= "ПолеВвода";
	ПараметрыВида.ОбязательноеЗаполнение				= Ложь;
	ПараметрыВида.РазрешитьВводНесколькихЗначений		= Ложь;
	ПараметрыВида.ЗапретитьРедактированиеПользователем	= Ложь;
	ПараметрыВида.Используется							= Истина;
	ПараметрыВида.НастройкиПроверки.ПроверятьКорректность		= Истина;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
КонецПроцедуры

#КонецОбласти

#Область ПанельКонтактнойИнформации

Функция ИндексПиктограммыПоТипу(ТипКИ) Экспорт
	
	Если ТипКИ = Перечисления.ТипыКонтактнойИнформации.Адрес Тогда
		ИндексКартинки = 12;
	ИначеЕсли ТипКИ = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты Тогда
		ИндексКартинки = 8;
	ИначеЕсли ТипКИ = Перечисления.ТипыКонтактнойИнформации.ВебСтраница Тогда
		ИндексКартинки = 9;
	ИначеЕсли ТипКИ = Перечисления.ТипыКонтактнойИнформации.Skype Тогда
		ИндексКартинки = 20;
	ИначеЕсли ТипКИ = Перечисления.ТипыКонтактнойИнформации.Другое Тогда
		ИндексКартинки = 11;
	ИначеЕсли ТипКИ = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
		ИндексКартинки = 7;
	ИначеЕсли ТипКИ = Перечисления.ТипыКонтактнойИнформации.Факс Тогда
		ИндексКартинки = 10;
	Иначе
		ИндексКартинки = 0;
	КонецЕсли;
	
	Возврат ИндексКартинки;
	
КонецФункции

Функция ЕстьРеквизитФормы(Реквизиты, Имя)
	
	Для каждого Реквизит Из Реквизиты Цикл
		Если Реквизит.Имя = Имя Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Процедура ПроверитьСоздатьРеквизитыПанели(Форма, ИмяГруппыРазмещения) Экспорт
		
	Если ЕстьРеквизитФормы(Форма.ПолучитьРеквизиты(), "ЕстьТаблицаДанныеПанелиКонтактнойИнформации") Тогда
		Возврат;
	КонецЕсли;
	
	НужноСоздатьТаблицуФормы = Истина; //НЕ (ОбщегоНазначения.ЭтоМобильныйКлиент());
	
	ДобавляемыеРеквизиты = Новый Массив;
	
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ЕстьТаблицаДанныеПанелиКонтактнойИнформации", Новый ОписаниеТипов("Булево")));
	
	Если НужноСоздатьТаблицуФормы Тогда
		// Создадим таблицу значений
		ИмяТаблицы = "ДанныеПанелиКонтактнойИнформации";
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(ИмяТаблицы, Новый ОписаниеТипов("ТаблицаЗначений")));
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("Отображение", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(150)), ИмяТаблицы));
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ИндексПиктограммы", Новый ОписаниеТипов("Число"), ИмяТаблицы));
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ТипОтображаемыхДанных", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(20)), ИмяТаблицы));
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ВладелецКИ", Новый ОписаниеТипов("СправочникСсылка.Контрагенты, Строка"), ИмяТаблицы));
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("Родитель", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"), ИмяТаблицы));
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ПредставлениеКИ", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(500)), ИмяТаблицы));
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ТипКИ", Новый ОписаниеТипов("ПеречислениеСсылка.ТипыКонтактнойИнформации"), ИмяТаблицы));
	КонецЕсли;
	
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	Если НужноСоздатьТаблицуФормы Тогда
		
		// Создадим элементы
		ТаблицаФормы = Форма.Элементы.Добавить(ИмяТаблицы, Тип("ТаблицаФормы"), Форма.Элементы[ИмяГруппыРазмещения]);
		ТаблицаФормы.ПутьКДанным = ИмяТаблицы;
		ТаблицаФормы.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;
		ТаблицаФормы.ИзменятьСоставСтрок = Ложь;
		ТаблицаФормы.ИзменятьПорядокСтрок = Ложь;
		ТаблицаФормы.РежимВыделенияСтроки = РежимВыделенияСтрокиТаблицы.Строка;
		ТаблицаФормы.Шапка = Ложь;
		ТаблицаФормы.АвтоВводНовойСтроки = Ложь;
		ТаблицаФормы.РазрешитьНачалоПеретаскивания = Ложь;
		ТаблицаФормы.РазрешитьПеретаскивание = Ложь;
		ТаблицаФормы.ГоризонтальнаяПолосаПрокрутки = ИспользованиеПолосыПрокрутки.НеИспользовать;
		ТаблицаФормы.ВертикальнаяПолосаПрокрутки = ИспользованиеПолосыПрокрутки.НеИспользовать;
		ТаблицаФормы.ГоризонтальныеЛинии = Ложь;
		ТаблицаФормы.ВертикальныеЛинии = Ложь;
		ТаблицаФормы.ЦветРамки = ЦветаСтиля.ЦветФонаФормы;
		ТаблицаФормы.Высота = 10;
		ТаблицаФормы.РастягиватьПоГоризонтали = Ложь;
		//Если ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		//	ТаблицаФормы.ИспользованиеТекущейСтроки = ИспользованиеТекущейСтрокиТаблицы.ОтображениеВыделения;
		//КонецЕсли;
		//ТаблицаФормы.УстановитьДействие("Выбор",				"Подключаемый_ДанныеПанелиКонтактнойИнформацииВыбор");
		//ТаблицаФормы.УстановитьДействие("ПриАктивизацииСтроки",	"Подключаемый_ДанныеПанелиКонтактнойИнформацииПриАктивизацииСтроки");
		
		Отображение = Форма.Элементы.Добавить(ИмяТаблицы + "Отображение", Тип("ПолеФормы"), ТаблицаФормы);
		Отображение.ПутьКДанным = ИмяТаблицы + ".Отображение";
		Отображение.Вид = ВидПоляФормы.ПолеНадписи;
		Отображение.РежимРедактирования = РежимРедактированияКолонки.Вход;
		Отображение.АвтоВысотаЯчейки = Истина;
		Отображение.Ширина = 23;
		
		Пиктограмма = Форма.Элементы.Добавить(ИмяТаблицы + "Пиктограмма", Тип("ПолеФормы"), ТаблицаФормы);
		Пиктограмма.ПутьКДанным = ИмяТаблицы + ".ИндексПиктограммы";
		Пиктограмма.Вид = ВидПоляФормы.ПолеКартинки;
		Пиктограмма.КартинкаЗначений = БиблиотекаКартинок.ВидыКонтактнойИнформации;
		Пиктограмма.АвтоВысотаЯчейки = Истина;
		Пиктограмма.ГиперссылкаЯчейки = Истина;
		Пиктограмма.Рамка = Новый Рамка(ТипРамкиЭлементаУправления.БезРамки, -1);
		Пиктограмма.Ширина = 1;
		Пиктограмма.РастягиватьПоГоризонтали = Ложь;
		Пиктограмма.РастягиватьПоВертикали = Ложь;
				
		Форма.ЕстьТаблицаДанныеПанелиКонтактнойИнформации = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьДанныеПанели(Форма, ВладелецКИ) Экспорт
	
	Если НЕ Форма.ЕстьТаблицаДанныеПанелиКонтактнойИнформации Тогда
		Возврат;
	КонецЕсли;
	
	Форма.ДанныеПанелиКонтактнойИнформации.Очистить();
	
	Если ВладелецКИ = Неопределено Тогда
		ДобавитьСообщениеОбОтсутствииДанных(Форма.ДанныеПанелиКонтактнойИнформации);
		Возврат;
	КонецЕсли;
	
	ЭтоГруппа = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВладелецКИ, "ЭтоГруппа");
	Если ЭтоГруппа Тогда
		ДобавитьСообщениеОбОтсутствииДанных(Форма.ДанныеПанелиКонтактнойИнформации);
		Возврат;
	КонецЕсли;
	
	МодульМенеджераВладельцаКИ = ОбщегоНазначения.МенеджерОбъектаПоСсылке(ВладелецКИ);
	МодульМенеджераВладельцаКИ.ЗаполнитьДанныеПанелиКонтактнаяИнформация(ВладелецКИ, Форма.ДанныеПанелиКонтактнойИнформации);
	
	Если Форма.ДанныеПанелиКонтактнойИнформации.Количество() = 0 Тогда
		ДобавитьСообщениеОбОтсутствииДанных(Форма.ДанныеПанелиКонтактнойИнформации);
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьСообщениеОбОтсутствииДанных(ДанныеПанелиКонтактнойИнформации)
	
	НоваяСтрока = ДанныеПанелиКонтактнойИнформации.Добавить();
	НоваяСтрока.Отображение = НСтр("ru='<Нет контактных данных>'");
	НоваяСтрока.ИндексПиктограммы = -1;
	НоваяСтрока.ТипОтображаемыхДанных = "НетДанных";
	НоваяСтрока.ВладелецКИ = Неопределено;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


#КонецОбласти
